# Вариант 13
## Условие задания 
### Жадный алгоритм для задачи о распределении ресурсов 
Задача: реализовать жадный алгоритм для оптимального распределения ресурсов среди 
проектов. 

Требования: 
- Каждый проект имеет требуемый ресурс и приносит прибыль
- Общий объем ресурсов ограничен
- Выбрать проекты для максимизации прибыли

Входные данные: 
Проекты: {(ресурс=10, прибыль=50), (ресурс=15, прибыль=80), 
(ресурс=20, прибыль=90), (ресурс=8, прибыль=40)} 
Общий ресурс: 40
### Определение
Жадный алгоритм для оптимального распределения ресурсов — это алгоритм, который на каждом шаге выбирает проект с максимальной эффективностью (прибыль на единицу ресурса) и распределяет доступные ресурсы в порядке убывания этой эффективности.
## Описание работы алгоритма

Алгоритм запрашивает общий объем доступных ресурсов и количество проектов. ( total_resources = float(input("Введите общий объем доступных ресурсов: ")))

Для каждого проекта вводятся данные: требуемый ресурс и ожидаемая прибыль.
(resource = float(input(" Требуемый ресурс: ")))

Вычисляется показатель эффективности каждого проекта как отношение прибыли к требуемому ресурсу.
(efficiency = profit / resource if resource > 0 else 0)

Проекты сортируются по убыванию эффективности.
(projects.sort(key=lambda x: x['efficiency'], reverse=True))

Алгоритм последовательно распределяет ресурсы между проектами согласно отсортированному списку.
(for project in projects:)

Если проект может быть выполнен полностью, он добавляется в список выбранных с полным использованием ресурсов.
(if used_resources + project['resource'] <= total_resources:)

Если ресурсов недостаточно для полного выполнения проекта, он добавляется частично с пропорциональной прибылью.
(fraction = remaining_resources / project['resource'])

Алгоритм выводит детальную информацию о распределении ресурсов и полученной прибыли.
(print(f"Общий объем ресурсов: {total_resources}"))

### Временная сложность
Временная сложность алгоритма составляет O(n log n), где n — количество проектов.
### Пояснение

Сортировка проектов по эффективности занимает O(n log n) операций. Согласно правилу доминирующих операций, общая сложность определяется наиболее затратной операцией. В данном случае сортировка O(n log n) преобладает над линейными операциями O(n).

## Контрольный вопрос 
### Вопрос 13. Табу-поиск.

Объясните концепцию табу-листа в алгоритме табу-поиска. Какую роль он играет?

### Ответ 
Табу-лист (список запретов) — это механизм кратковременной памяти, который хранит недавно выполненные решения или их атрибуты, запрещая к ним возвращаться в течение определенного времени.

Роль и функции табу-листа
1. Предотвращение циклов и возвратов. Запрещает возврат к ранее посещенным решениям. Исключает зацикливание алгоритма в локальных оптимумах. Пример: если перестановка элементов A и B была выполнена, она добавляется в табу-лист

2. Управление разнообразием поиска. Вынуждает алгоритм исследовать новые области пространства решений. Стимулирует выход из локальных оптимумов.Поддерживает баланс между интенсификацией и диверсификацией

3. Критерии включения в табу-лист. Атрибуты решений (например, конкретные перемещения). Целые решения (редко, из-за требований к памяти). Хэш-значения решений для экономии памяти

4. Стратегии управления табу-листом. Фиксированный размер — ограниченное количество хранимых элементов. Время запрета — элементы автоматически удаляются через заданное число итераций. Динамическое изменение — адаптация размера в процессе работы

5. Критерии отмены запрета (Aspiration Criteria). Разрешает использование табу-элемента, если он приводит к глобально лучшему решению. Отменяет запрет при достижении рекордного значения целевой функции

Табу-лист обычно реализуется как:

Очередь фиксированного размера (FIFO)

Хэш-таблица для быстрого поиска

Массив с временными метками

Эффект: алгоритм "запоминает" недавний путь поиска и вынужден исследовать новые направления, что значительно повышает эффективность глобального поиска по сравнению с чисто жадными стратегиями.
