# Вариант 13
## Условие задания 
### Жадный алгоритм для задачи о распределении ресурсов 
Задача: реализовать жадный алгоритм для оптимального распределения ресурсов среди 
проектов. 

Требования: 
- Каждый проект имеет требуемый ресурс и приносит прибыль
- Общий объем ресурсов ограничен
- Выбрать проекты для максимизации прибыли

Входные данные: 
Проекты: {(ресурс=10, прибыль=50), (ресурс=15, прибыль=80), 
(ресурс=20, прибыль=90), (ресурс=8, прибыль=40)} 
Общий ресурс: 40
### Определение
Жадный алгоритм для оптимального распределения ресурсов — это алгоритм, который на каждом шаге выбирает проект с максимальной эффективностью (прибыль на единицу ресурса) и распределяет доступные ресурсы в порядке убывания этой эффективности.
## Описание работы алгоритма

Алгоритм запрашивает общий объем доступных ресурсов и количество проектов. ( total_resources = float(input("Введите общий объем доступных ресурсов: ")))

Для каждого проекта вводятся данные: требуемый ресурс и ожидаемая прибыль.
(resource = float(input(" Требуемый ресурс: ")))

Вычисляется показатель эффективности каждого проекта как отношение прибыли к требуемому ресурсу.
(efficiency = profit / resource if resource > 0 else 0)

Проекты сортируются по убыванию эффективности.
(projects.sort(key=lambda x: x['efficiency'], reverse=True))

Алгоритм последовательно распределяет ресурсы между проектами согласно отсортированному списку.
(for project in projects:)

Если проект может быть выполнен полностью, он добавляется в список выбранных с полным использованием ресурсов.
(if used_resources + project['resource'] <= total_resources:)

Если ресурсов недостаточно для полного выполнения проекта, он добавляется частично с пропорциональной прибылью.
(fraction = remaining_resources / project['resource'])

Алгоритм выводит детальную информацию о распределении ресурсов и полученной прибыли.
(print(f"Общий объем ресурсов: {total_resources}"))

### Временная сложность
Временная сложность алгоритма составляет O(n log n), где n — количество проектов.
### Пояснение

Сортировка проектов по эффективности занимает O(n log n) операций.


